https://leetcode.com/problems/find-the-quiet-students-in-all-exams/

In [1]:
%load_ext sql

In [2]:
import sqlalchemy

In [3]:
%sql mysql://root:root@localhost

In [4]:
%%sql 

show tables;

 * mysql://root:***@localhost
(_mysql_exceptions.OperationalError) (1046, 'No database selected')
[SQL: show tables;]
(Background on this error at: http://sqlalche.me/e/14/e3q8)

In [14]:
%%sql

##Create schema question_1412;
use question_1412;

Create table If Not Exists Student (student_id int, student_name varchar(30));
Create table If Not Exists Exam (exam_id int, student_id int, score int);
Truncate table Student;
insert into Student (student_id, student_name) values ('1', 'Daniel');
insert into Student (student_id, student_name) values ('2', 'Jade');
insert into Student (student_id, student_name) values ('3', 'Stella');
insert into Student (student_id, student_name) values ('4', 'Jonathan');
insert into Student (student_id, student_name) values ('5', 'Will');
Truncate table Exam;
insert into Exam (exam_id, student_id, score) values ('10', '1', '70');
insert into Exam (exam_id, student_id, score) values ('10', '2', '80');
insert into Exam (exam_id, student_id, score) values ('10', '3', '90');
insert into Exam (exam_id, student_id, score) values ('20', '1', '80');
insert into Exam (exam_id, student_id, score) values ('30', '1', '70');
insert into Exam (exam_id, student_id, score) values ('30', '3', '80');
insert into Exam (exam_id, student_id, score) values ('30', '4', '90');
insert into Exam (exam_id, student_id, score) values ('40', '1', '60');
insert into Exam (exam_id, student_id, score) values ('40', '2', '70');
insert into Exam (exam_id, student_id, score) values ('40', '4', '80');

 * mysql://root:***@localhost
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
0 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [15]:
%%sql 

select * from exam;

 * mysql://root:***@localhost
10 rows affected.

[(10, 1, 70),
 (10, 2, 80),
 (10, 3, 90),
 (20, 1, 80),
 (30, 1, 70),
 (30, 3, 80),
 (30, 4, 90),
 (40, 1, 60),
 (40, 2, 70),
 (40, 4, 80)]

In [16]:
%%sql
select * from student;

 * mysql://root:***@localhost
5 rows affected.

[(1, 'Daniel'), (2, 'Jade'), (3, 'Stella'), (4, 'Jonathan'), (5, 'Will')]

In [17]:
%%sql
select min(score), max(Score) from exam

 * mysql://root:***@localhost
1 rows affected.

[(60, 90)]

In [18]:
%%sql
select *, dense_rank() over (partition by exam_id order by score) as subject_rank
from exam

 * mysql://root:***@localhost
10 rows affected.

[(10, 1, 70, 1),
 (10, 2, 80, 2),
 (10, 3, 90, 3),
 (20, 1, 80, 1),
 (30, 1, 70, 1),
 (30, 3, 80, 2),
 (30, 4, 90, 3),
 (40, 1, 60, 1),
 (40, 2, 70, 2),
 (40, 4, 80, 3)]

In [19]:
%%sql

with score_table as (select t.student_id, t.student_name, t.exam_id, t.score, 
dense_rank() over(partition by t.exam_id order by t.score desc) as subject_rank, 
max(t.score) over (partition by t.exam_id order by t.score desc) as max_rank,
min(t.score) over (partition by t.exam_id order by t.score) as min_rank
from 
(select exam.student_id, student.student_name, exam.exam_id,  exam.score from exam
left join student 
on exam.student_id = student.student_id) as t)

select distinct student_id, student_name
from score_table
where student_id not in (select student_id from score_table where score = max_rank or score = min_rank)

 * mysql://root:***@localhost
1 rows affected.

[(2, 'Jade')]

In [20]:
%%sql

with score_table as (select exam.student_id, student.student_name, exam.exam_id, exam.score, 
dense_rank() over(partition by exam.exam_id order by exam.score desc) as subject_rank, 
max(exam.score) over (partition by exam.exam_id order by exam.score desc) as max_rank,
min(exam.score) over (partition by exam.exam_id order by exam.score) as min_rank
from exam
left join student 
on exam.student_id = student.student_id)

select distinct student_id, student_name
from score_table
where student_id not in (select student_id from score_table where score = max_rank or score = min_rank)
order by student_id

 * mysql://root:***@localhost
1 rows affected.

[(2, 'Jade')]

In [21]:
%%sql

with score_table as (select exam.student_id, student.student_name, exam.exam_id, exam.score, 
max(exam.score) over (partition by exam.exam_id order by exam.score desc) as max_rank,
min(exam.score) as min_rank
from exam
join student 
on exam.student_id = student.student_id)

select distinct student_id, student_name
from score_table
where student_id not in (select student_id from score_table where score = max_rank or score = min_rank)
order by student_id

 * mysql://root:***@localhost
0 rows affected.

[]

In [58]:
%%sql
select exam.student_id, student.student_name, exam.exam_id, exam.score, 
max(exam.score) over (partition by exam.exam_id) as max_rank,
min(exam.score) over (partition by exam.exam_id) as min_rank
from exam
join student 
on exam.student_id = student.student_id

 * mysql://root:***@localhost
10 rows affected.

[(1, 'Daniel', 10, 70, 90, 70),
 (2, 'Jade', 10, 80, 90, 70),
 (3, 'Stella', 10, 90, 90, 70),
 (1, 'Daniel', 20, 80, 80, 80),
 (1, 'Daniel', 30, 70, 90, 70),
 (3, 'Stella', 30, 80, 90, 70),
 (4, 'Jonathan', 30, 90, 90, 70),
 (1, 'Daniel', 40, 60, 80, 60),
 (2, 'Jade', 40, 70, 80, 60),
 (4, 'Jonathan', 40, 80, 80, 60)]

In [64]:
%%sql
select exam.student_id, student.student_name, exam.exam_id, exam.score, 
row_number() over(partition by exam.exam_id) as subject_rank, 
max(exam.score) over (partition by exam.exam_id) as max_rank,
min(exam.score) over (partition by exam.exam_id) as min_rank
from exam
join student 
on exam.student_id = student.student_id

 * mysql://root:***@localhost
10 rows affected.

[(1, 'Daniel', 10, 70, 1, 70, 70),
 (2, 'Jade', 10, 80, 2, 80, 70),
 (3, 'Stella', 10, 90, 3, 90, 70),
 (1, 'Daniel', 20, 80, 1, 80, 80),
 (1, 'Daniel', 30, 70, 1, 70, 70),
 (3, 'Stella', 30, 80, 2, 80, 70),
 (4, 'Jonathan', 30, 90, 3, 90, 70),
 (1, 'Daniel', 40, 60, 1, 60, 60),
 (2, 'Jade', 40, 70, 2, 70, 60),
 (4, 'Jonathan', 40, 80, 3, 80, 60)]

In [37]:
%%sql
select *
from exam, student
where student.student_id = exam.student_id

 * mysql://root:***@localhost
10 rows affected.

[(10, 1, 70, 1, 'Daniel'),
 (10, 2, 80, 2, 'Jade'),
 (10, 3, 90, 3, 'Stella'),
 (20, 1, 80, 1, 'Daniel'),
 (30, 1, 70, 1, 'Daniel'),
 (30, 3, 80, 3, 'Stella'),
 (30, 4, 90, 4, 'Jonathan'),
 (40, 1, 60, 1, 'Daniel'),
 (40, 2, 70, 2, 'Jade'),
 (40, 4, 80, 4, 'Jonathan')]

## Better Solution

In [65]:
%%sql
with cte as 
(SELECT student.*, 
        exam.exam_id, 
        exam.score, 
        MAX(exam.score) OVER(PARTITION BY exam.exam_id) as 'max_score_exam',
        MIN(exam.score) OVER(PARTITION BY exam.exam_id) AS 'min_Score_exam'
    FROM student 
    INNER JOIN exam 
        ON student.student_id = exam.student_id) 



SELECT DISTINCT(student_id), student_name
FROM cte
WHERE student_id NOT IN (SELECT student_id FROM cte WHERE score = max_score_Exam OR score= min_score_Exam)
ORDER BY student_id

 * mysql://root:***@localhost
1 rows affected.

[(2, 'Jade')]